#Linux

##L
ln [オプション] [リンク元] [リンク先]
ファイルやディレクトリの「リンク」を作成する
＜option＞
-s: シンボリックリンク（ソフトリンク）を作成する
-f: 既存のリンクやファイルを強制的に上書きする
-v: 作成されたリンクの詳細情報を表示する（verbose）。
-n: シンボリックリンクをディレクトリに対して上書きせず扱う。

ls
<option>
-a:	隠しファイル（.で始まるファイル）を含めてすべて表示。
-l:	詳細情報（長い形式）を表示。所有者、グループ、パーミッション、サイズ、日付などを表示。
-h:	ファイルサイズを人間にわかりやすい単位（KB、MBなど）で表示（-lオプションと併用）。
-R:	指定したディレクトリ以下を再帰的に表示。
-t:	更新日時順に並べ替え。
-r:	逆順で表示。
-d:	ディレクトリ自体を表示（中身は表示しない）。
-1:	各ファイルやディレクトリを1行ずつ表示（デフォルトで幅広表示するシステム設定がある場合に便利）。
--color=auto	ファイルやディレクトリを種類ごとに色分けして表示（多くの環境でデフォルト設定）。

#ROS2

##
